## Data Frames

In [1]:
# There are built in Data sets in R for practice purpose
df <- state.x77 # This is a built in data set

In [15]:
# to see the data set
head(df) #first 6 rows

           Population Income Illiteracy Life Exp Murder HS Grad Frost Area
Alabama     3615      3624   2.1        69.05    15.1   41.3     20    50708
Alaska       365      6315   1.5        69.31    11.3   66.7    152   566432
Arizona     2212      4530   1.8        70.55     7.8   58.1     15   113417
Arkansas    2110      3378   1.9        70.66    10.1   39.9     65    51945
California 21198      5114   1.1        71.71    10.3   62.6     20   156361
Colorado    2541      4884   0.7        72.06     6.8   63.9    166   103766

In [2]:
# to see/select number of rows with head function
head(df,10)

            Population Income Illiteracy Life Exp Murder HS Grad Frost Area
Alabama      3615      3624   2.1        69.05    15.1   41.3     20    50708
Alaska        365      6315   1.5        69.31    11.3   66.7    152   566432
Arizona      2212      4530   1.8        70.55     7.8   58.1     15   113417
Arkansas     2110      3378   1.9        70.66    10.1   39.9     65    51945
California  21198      5114   1.1        71.71    10.3   62.6     20   156361
Colorado     2541      4884   0.7        72.06     6.8   63.9    166   103766
Connecticut  3100      5348   1.1        72.48     3.1   56.0    139     4862
Delaware      579      4809   0.9        70.06     6.2   54.6    103     1982
Florida      8277      4815   1.3        70.66    10.7   52.6     11    54090
Georgia      4931      4091   2.0        68.54    13.9   40.6     60    58073

In [16]:
# data() this gives the list of various inbuilt datasets

In [17]:
tail(df) # Last 6 rows

              Population Income Illiteracy Life Exp Murder HS Grad Frost Area
Vermont        472       3907   0.6        71.64    5.5    57.1    168    9267
Virginia      4981       4701   1.4        70.08    9.5    47.8     85   39780
Washington    3559       4864   0.6        71.72    4.3    63.5     32   66570
West Virginia 1799       3617   1.4        69.48    6.7    41.6    100   24070
Wisconsin     4589       4468   0.7        72.48    3.0    54.5    149   54464
Wyoming        376       4566   0.6        70.29    6.9    62.9    173   97203

In [4]:
# to select/view last number of rows of a dataframe with tail function
tail(df,2)

          Population Income Illiteracy Life Exp Murder HS Grad Frost Area
Wisconsin 4589       4468   0.7        72.48    3.0    54.5    149   54464
Wyoming    376       4566   0.6        70.29    6.9    62.9    173   97203

In [18]:
summary(df) # Some exploratory information

   Population        Income       Illiteracy       Life Exp
 Min.   :  365   Min.   :3098   Min.   :0.500   Min.   :67.96
 1st Qu.: 1080   1st Qu.:3993   1st Qu.:0.625   1st Qu.:70.12
 Median : 2838   Median :4519   Median :0.950   Median :70.67
 Mean   : 4246   Mean   :4436   Mean   :1.170   Mean   :70.88
 3rd Qu.: 4968   3rd Qu.:4814   3rd Qu.:1.575   3rd Qu.:71.89
 Max.   :21198   Max.   :6315   Max.   :2.800   Max.   :73.60
     Murder          HS Grad          Frost             Area
 Min.   : 1.400   Min.   :37.80   Min.   :  0.00   Min.   :  1049
 1st Qu.: 4.350   1st Qu.:48.05   1st Qu.: 66.25   1st Qu.: 36985
 Median : 6.850   Median :53.25   Median :114.50   Median : 54277
 Mean   : 7.378   Mean   :53.11   Mean   :104.46   Mean   : 70736
 3rd Qu.:10.675   3rd Qu.:59.15   3rd Qu.:139.75   3rd Qu.: 81162
 Max.   :15.100   Max.   :67.30   Max.   :188.00   Max.   :566432

In [19]:
str(df)

 num [1:50, 1:8] 3615 365 2212 2110 21198 ...
 - attr(*, "dimnames")=List of 2
  ..$ : chr [1:50] "Alabama" "Alaska" "Arizona" "Arkansas" ...
  ..$ : chr [1:8] "Population" "Income" "Illiteracy" "Life Exp" ...

In [21]:
is.data.frame(df)

[1] FALSE

In [22]:
# Making a data frame from scratch
Days <- c("Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun")
Temps <- c(32,34,33.5,31,33,33.8,35)
Rain <- c(T,T,F,F,T,F,T)
df1<- data.frame(Days,Temps,Rain)

In [23]:
df1

  Days Temps Rain
1 Mon  32.0   TRUE
2 Tue  34.0   TRUE
3 Wed  33.5  FALSE
4 Thu  31.0  FALSE
5 Fri  33.0   TRUE
6 Sat  33.8  FALSE
7 Sun  35.0   TRUE

In [25]:
is.data.frame(df1)

[1] TRUE

In [28]:
class(df1)

[1] "data.frame"

In [29]:
str(df1)

'data.frame':	7 obs. of  3 variables:
 $ Days : Factor w/ 7 levels "Fri","Mon","Sat",..: 2 6 7 5 1 3 4
 $ Temps: num  32 34 33.5 31 33 33.8 35
 $ Rain : logi  TRUE TRUE FALSE FALSE TRUE FALSE ...

In [30]:
# Column names of dataframe
colnames(df1)

[1] "Days"  "Temps" "Rain"

In [32]:
# Index or row names
rownames(df1)

[1] "1" "2" "3" "4" "5" "6" "7"

#### Creating Data Frames

In [70]:
empty <- data.frame() # data.frame is the key word to create the dataframes
class(empty)

[1] "data.frame"

In [71]:
# Creating a dataframe from vectors
AGE <- c(21,23,28,27,30)
NAME <- c('Raj',"Rani","Laila",'John',"Julia")
GENDER <- c('Male','Female','Female','Male','Female')
studentdf <- data.frame(NAME,AGE,GENDER)
studentdf

  NAME  AGE GENDER
1 Raj   21  Male
2 Rani  23  Female
3 Laila 28  Female
4 John  27  Male
5 Julia 30  Female

In [72]:
class(studentdf)

[1] "data.frame"

In [73]:
studentdf[studentdf['GENDER'] == 'Female',] # Filtering the data from the df
# This is like asking all the rows that match this criteria
#df[matching criteria,] notice the ,

  NAME  AGE GENDER
2 Rani  23  Female
3 Laila 28  Female
5 Julia 30  Female

### Information about the dataframe

In [74]:
# Number of columns
ncol(studentdf)

[1] 3

In [75]:
# number of rows
nrow(studentdf)

[1] 5

In [76]:
summary(studentdf)

    NAME        AGE          GENDER
 John :1   Min.   :21.0   Female:3
 Julia:1   1st Qu.:23.0   Male  :2
 Laila:1   Median :27.0
 Raj  :1   Mean   :25.8
 Rani :1   3rd Qu.:28.0
           Max.   :30.0

In [77]:
#column names
colnames(studentdf)

[1] "NAME"   "AGE"    "GENDER"

In [78]:
# Structure of the dataframe
str(studentdf)

'data.frame':	5 obs. of  3 variables:
 $ NAME  : Factor w/ 5 levels "John","Julia",..: 4 5 3 1 2
 $ AGE   : num  21 23 28 27 30
 $ GENDER: Factor w/ 2 levels "Female","Male": 2 1 1 2 1

#### Referencing Single cells and assigning a new value to it

In [79]:
studentdf

  NAME  AGE GENDER
1 Raj   21  Male
2 Rani  23  Female
3 Laila 28  Female
4 John  27  Male
5 Julia 30  Female

In [80]:
# For example if we have to change 'Rani''s age to 999
# reference this cell  and assign a new value
#syntax df[[row,col]]
studentdf[[2,2]]

[1] 23

In [81]:
# Another way to reference
studentdf[[2, 'AGE']]

[1] 23

In [82]:
# This can be assigned with a new value
studentdf[[2, 'AGE']] <- 999

In [83]:
studentdf

  NAME  AGE GENDER
1 Raj    21 Male
2 Rani  999 Female
3 Laila  28 Female
4 John   27 Male
5 Julia  30 Female